In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('data/scientists.csv')

In [7]:
A= data['Died']

In [8]:
A[0], data['Died'][0]

('1958-04-16', '1958-04-16')

In [9]:
data

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [10]:
data['Age group'] =data['Age']//10*10

,Name,Born,Died,Age,Occupation,Age group
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,30
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,60
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,90
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,60
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,50
5,John Snow,1813-03-15,1858-06-16,45,Physician,40
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,40
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,70

In [12]:
data.to_csv('scientists_agegroup.csv')

In [13]:
df1 = pd.read_csv('data/concat_1.csv')
df2 = pd.read_csv('data/concat_2.csv')
df3 = pd.read_csv('data/concat_3.csv')

In [39]:
row_concat = pd.concat([df1, df2, df3], ignore_index=True)

In [40]:
row_concat

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [19]:
new_row_series = pd.Series(['n1', 'n2', 'n3', 'n4'])

In [33]:
new_row_series.rename_axis('E')

E
0    n1
1    n2
2    n3
3    n4
dtype: object

In [34]:
new_row_series

0    n1
1    n2
2    n3
3    n4
dtype: object

In [35]:
result = pd.concat([df1,new_row_series ], axis=1)

In [36]:
result

    A   B   C   D   0
0  a0  b0  c0  d0  n1
1  a1  b1  c1  d1  n2
2  a2  b2  c2  d2  n3
3  a3  b3  c3  d3  n4

In [31]:
result.columns

Index(['A', 'B', 'C', 'D', 0], dtype='object')

In [27]:
result.rename(columns={0:'E'})

    A   B   C   D   E
0  a0  b0  c0  d0  n1
1  a1  b1  c1  d1  n2
2  a2  b2  c2  d2  n3
3  a3  b3  c3  d3  n4